SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/Enums/СтатусыБлюда/СтатусыБлюда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыБлюда</name>
  <enumValues>
    <name>Готовиться</name>
  </enumValues>
  <enumValues>
    <name>Готово</name>
  </enumValues>
  <enumValues>
    <name>Отдано</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПринят</name>
  </enumValues>
  <enumValues>
    <name>ПереданНаКухню</name>
  </enumValues>
</mdclass:Enum>

SaitovSP/src/Enums/СтатусЗаказа/СтатусЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказа</name>
  <enumValues>
    <name>ГотовДляДоставки</name>
  </enumValues>
  <enumValues>
    <name>ВДоставке</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлен</name>
  </enumValues>
</mdclass:Enum>

SaitovSP/src/Documents/Заказы/ManagerModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.Заказы.ПолучитьМакет("ПредварительныйЧек");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.Дата КАК Дата,
	|	Заказы.ДатаЗакрытияЗаказа КАК ДатаЗакрытияЗаказа,
	|	Заказы.ЗаказЗакрыт КАК ЗаказЗакрыт,
	|	Заказы.Итого КАК Итого,
	|	Заказы.Номер КАК Номер,
	|	Заказы.НомерСтола КАК НомерСтола,
	|	Заказы.Официант КАК Официант,
	|	Заказы.Ресторан КАК Ресторан,
	|	Заказы.Блюда.(
	|		НомерСтроки КАК НомерСтроки,
	|		Блюдо КАК Блюдо,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Блюда
	|ИЗ
	|	Документ.Заказы КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьБлюдаШапка = Макет.ПолучитьОбласть("БлюдаШапка");
	ОбластьБлюда = Макет.ПолучитьОбласть("Блюда");
	ОбластьСертификатыШапка = Макет.ПолучитьОбласть("СертификатыШапка");
	ОбластьСертификаты = Макет.ПолучитьОбласть("Сертификаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Заголовок = "Чек, заказ закрыт";
		Если Выборка.ДатаЗакрытияЗаказа = '00010101' Тогда 
			Заголовок = "Предварительный чек, заказ Открыт"; 
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заголовок = Заголовок;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьБлюдаШапка);
		ВыборкаБлюда = Выборка.Блюда.Выбрать();
		Пока ВыборкаБлюда.Следующий() Цикл
			ОбластьБлюда.Параметры.Заполнить(ВыборкаБлюда);
			ТабДок.Вывести(ОбластьБлюда, ВыборкаБлюда.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
	КонецЦикла;

КонецПроцедуры

Функция СозданиеДокументаЗаказ (Параметры) Экспорт
	
	НовыйЗаказ 						= СоздатьДокумент();
	НовыйЗаказ.Дата 				= ТекущаяДата();
	НовыйЗаказ.ЗаказЗакрыт 			= Ложь;
	НовыйЗаказ.Итого				= 0;
	НовыйЗаказ.НомерСтола			= Параметры.НомерСтола;
	НовыйЗаказ.Официант				= Параметры.Официант;
	НовыйЗаказ.Резерв				= Параметры.Резерв;
	НовыйЗаказ.Ресторан				= ПараметрыСеанса.ТекущийРесторан;
	НовыйЗаказ.ДатаРезерва			= Параметры.ДатаРезерва;
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовыйЗаказ.Ссылка;
	
КонецФункции

Процедура РедактированиеДокумента (СсылкаЗаказ, Параметры, РежимЗаписи) Экспорт

	ДокРезерв 						= СсылкаЗаказ.ПолучитьОбъект();
	
	ДокРезерв.ДатаЗакрытияЗаказа 	= Параметры.ДатаЗакрытияЗаказа;
	ДокРезерв.ЗаказЗакрыт 			= Параметры.ЗаказЗакрыт;
	ДокРезерв.Итого					= Параметры.Итого;
	ДокРезерв.Клиент				= Параметры.Клиент;
	ДокРезерв.НомерСтола			= Параметры.НомерСтола;
	ДокРезерв.ОплатаСертификатом	= Параметры.ОплатаСертификатом;
	ДокРезерв.Резерв				= Параметры.Резерв;
	ДокРезерв.Ресторан				= Параметры.Ресторан;
	ДокРезерв.СертификатОплаты		= Параметры.СертификатОплаты;
	ДокРезерв.СкидочнаяКарта		= Параметры.СкидочнаяКарта;
	
	ТЧДокРезервБлюда = ДокРезерв.Блюда;	
	СтутусБлюдаПереданНаКухню = Перечисления.СтатусыБлюда.ПереданНаКухню;
	СтатусБлюдаЗаказПринят = Перечисления.СтатусыБлюда.ЗаказПринят;
	
	Для каждого ТекущаяСТрокаТабличнойЧастиАРМа Из Параметры.Блюда Цикл		
		Если ТекущаяСТрокаТабличнойЧастиАРМа.Статус = СтатусБлюдаЗаказПринят Тогда
			
			Для Каждого ТекущаяСтрока Из ТЧДокРезервБлюда Цикл
				Если ТекущаяСТрока.ИдентификаторСтроки = ТекущаяСТрокаТабличнойЧастиАРМа.ИдентификаторСтроки Тогда
					Продолжить;
				КонецЕсли;
			КонецЦикла;
						
			НоваяСтрокаПриемник 					= ТЧДокРезервБлюда.Добавить();
			НоваяСтрокаПриемник.Блюдо 				= ТекущаяСТрокаТабличнойЧастиАРМа.Блюдо;
			НоваяСтрокаПриемник.Количество 			= ТекущаяСТрокаТабличнойЧастиАРМа.Количество;
			НоваяСтрокаПриемник.Статус 				= СтутусБлюдаПереданНаКухню;
			НоваяСтрокаПриемник.Сумма 				= ТекущаяСТрокаТабличнойЧастиАРМа.Сумма;
			НоваяСтрокаПриемник.Цена 				= ТекущаяСТрокаТабличнойЧастиАРМа.Цена;
			НоваяСтрокаПриемник.ИдентификаторСтроки = ТекущаяСТрокаТабличнойЧастиАРМа.ИдентификаторСтроки;
			НоваяСтрокаПриемник.ПричинаОтказа 		= ТекущаяСТрокаТабличнойЧастиАРМа.ПричинаОтказа;
			
		КонецЕсли;		
		Для каждого ТекущаяСтрока Из ТЧДокРезервБлюда Цикл		
			Если ТекущаяСТрокаТабличнойЧастиАРМа.ПричинаОтказа <> ТекущаяСтрока.ПричинаОтказа
			И ТекущаяСТрокаТабличнойЧастиАРМа.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки Тогда			
				ТекущаяСтрока.ПричинаОтказа = ТекущаяСТрокаТабличнойЧастиАРМа.ПричинаОтказа;			
			КонецЕсли;		
		КонецЦикла;		
	КонецЦикла;		
	ДокРезерв.Записать(РежимЗаписи);

КонецПроцедуры

Процедура РедактированиеДокументаПоваром(СтруктураЗаказа) Экспорт

	ДокРезерв = СтруктураЗаказа.Ссылка.ПолучитьОбъект();
	СтатусГотово = Перечисления.СтатусыБлюда.Готово;
	ВсеГотово = Истина;

	Для Каждого ТекущаяСтрока Из ДокРезерв.Блюда Цикл
	    //Поиск строки и изменение данных в ней
		Если ТекущаяСтрока.ИдентификаторСтроки = СтруктураЗаказа.ИдентификаторСтроки Тогда
			ТекущаяСтрока.Повар = СтруктураЗаказа.Повар;
			ТекущаяСтрока.Статус = СтруктураЗаказа.Статус;
		КонецЕсли;
		Если ТекущаяСтрока.Статус <> СтатусГотово Тогда
			ВсеГотово = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ВсеГотово Тогда
		ДокРезерв.ГотовДляДоставки = Истина;
		ДокРезерв.СтатусЗаказа = Перечисления.СтатусЗаказа.ГотовДляДоставки;
	КонецЕсли;
	
	ДокРезерв.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ЗаписьНазначенияКурьера(Заказ, Курьер, Статус) Экспорт
	
	ДокРезерв = Заказ.Ссылка.ПолучитьОбъект();
	ДокРезерв.Курьер = Курьер;
	ДокРезерв.СтатусЗаказа = Статус;
	ДокРезерв.ВремяВыдачиЗаказаКурьеру = ТекущаяДата();	
	ДокРезерв.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗакрытиеНеДоставленногоЗаказа(Ссылка) Экспорт

	ДокРезерв = Ссылка.ПолучитьОбъект();
	ДокРезерв.ЗаказЗакрыт = Истина;
	ДокРезерв.ДатаЗАкрытияЗаказа = ТекущаяДата();
	ДокРезерв.СтатусЗаказа = Перечисления.СтатусЗаказа.НеДоставлен;
	ДокРезерв.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

#КонецОбласти
